![test](./topic.png)

![test](./nagare.png)  

# ■ コンピュータとは  
> 自動計算機。  
とくに計算開始後は人手を介さずに計算終了まで動作する電子汎用機。  
今日のコンピュータの原型は、1940年代前後に登場した。当初は、回路素子として真空管が使用されていた。コンピュータの基本的構成は、フォン・ノイマンによって提唱されたノイマン型コンピュータと呼ばれるアーキテクチャが採用され、現在のほとんどのコンピュータにおいて受け継がれている。  
## ▽ ノイマン型コンピュータとは  
> 入力装置、出力装置、中央演算装置（CPU）、主記憶装置（メインメモリ）、補助記憶装置（外部記憶装置）などから構成される。入力装置はキーボードのようなものを指す。出力装置はデータをコンピュータの外部に取り出す役割を持つものであり、ディスプレイや印刷装置（プリンタ）などが該当する。中央演算装置は、処理を実行する。記憶装置は主に主記憶装置と補助記憶装置からなり、中央演算装置のすぐ側に配置されて高速なデータの出し入れを行う主記憶装置と、処理速度は遅いものの大容量の記憶保持が可能な補助記憶装置とで役割分担をしている。主記憶装置には、半導体による記憶素子（半導体メモリー）が利用されるが、コストが高いために、あまり大容量のものを搭載することはできない。補助記憶装置には、速度的には劣るものの、大容量でかつ価格の安いハードディスク（HDD）のような記憶媒体が用いられている。  

## ▽ コンピュータの種類  
> 。一般的にパソコン（パーソナルコンピュータ）と呼ばれるタイプのコンピュータをはじめ、ワークステーションやオフコンと呼ばれる中大型装置、企業などで利用される大型のメインフレーム、あるいは、建物ほどのサイズがあるスーパーコンピュータなどがある。その他方で、PDAや携帯電話、電子辞書などに組み込まれ、手のひらサイズの装置の中で入出力や計算処理をすべてこなせる小型の端末がある。さまざまなスケールで利用されているが、総じて小型化・高密度化が推し進められている。また、通信機器や制御機械など、現代社会を支えるインフラストラクチャーのあらゆる場面で利用されるようになっている。超小型のコンピュータを含め、さまざまな形態のコンピュータが社会のあらゆる場面で利用される有様は、ユビキタス社会と形容される。  

## ▽ コンピュータの構成要素
>

![test](./kouiu.png)  

![test](./syurui.png)  
